icoFoamContinuation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    outlet
    {
        type            patch;
        nFaces          96;
        startFace       26232;
    }
    upperWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          120;
        startFace       26328;
    }
    lowerWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          120;
        startFace       26448;
    }
    inlet
    {
        type            patch;
        nFaces          96;
        startFace       26568;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       26664;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          26496;
        startFace       26760;
    }
)

// ************************************************************************* //
